[
  {
    "title": "Karen Mossberger",
    "author": "",
    "published_date": "2024-12-11 00:04:57",
    "published_date_precision": "full",
    "link": "https://theconversation.com/profiles/karen-mossberger-2278122",
    "clean_url": "theconversation.com",
    "excerpt": "Karen Mossberger — Profile on The Conversation",
    "summary": "Karen Mossberger is Professor Emerita in the School of Public Affairs in the Watts College of Public Service and Community Solutions at Arizona State University. She is Director Emerita of the Center on Technology, Data and Society and also a senior sustainability scholar with the Julie Ann Wrigley Global Institute of Sustainability. She formerly held the Frank and June Sackton Chair in the School of Public Affairs. Her research interests include local governance, urban policy, digital inequality, evaluation of broadband programs and digital government.\nShe is author/editor of 7 books, including \"Choosing the Future: Technology and Opportunity in Communities\" (Oxford University Press 2021, with C. Tolbert and S. LaCombe), which won the 2022 Goldsmith Prize for Best Academic Book from the Shorenstein Center, Harvard Kennedy School of Government. The book demonstrates with nearly two decades of data the impact that widespread, inclusive broadband use has for community prosperity. She is also a co-editor for \"Transforming Everything? Evaluating Broadband's Impacts Across Policy Areas\" (Oxford University Press 2021, with Eric Welch and Yonghong Wu).\nOther books on technology, inequality, and public policy include \"Digital Cities: The Internet and the Geography of Opportunity\" (Oxford University Press 2012, with C. Tolbert and W. Franko), \"Digital Citizenship: The Internet, Society and Participation\" (Mossberger, Tolbert and McNeal 2008, MIT Press), and \"Virtual Inequality: Beyond the Digital Divide\" (Mossberger, Tolbert and Stansbury 2003, Georgetown University Press), She is also a co-editor of the \"Oxford Handbook of Urban Politics\" (2012 with S. Clarke and P. John) and author of \"The Politics of Ideas and the Spread of Enterprise Zones\" (2000, Georgetown University Press).\nIn 2023, she received the NASPAA/ASPA Research Award from the Network of Schools of Public Policy, Affairs and Administration and the American Society for Public Administration. She was also honored with the ASU Founder's Day Award for Faculty Research in 2023. Her research on 'Race, Place, and Information Technology' won the best paper award for the Public Policy Section of the American Political Science Association in 2005, and \"The Effects of E-Government on Trust and Confidence in Government\" was chosen as one of the 75 most influential articles in the first 75 years of Public Administration Review. In 2018, she received the Donald C. Stone Scholar award from the American Society for Public Administration's Section on Intergovernmental Administration and Management (SIAM). In 2019 she was selected by UK nonprofit Apolitical as one of the World's 100 Most Influential People in Digital Government - a list including practitioners and academics.\nHer research has been supported by the National Science Foundation, Smith Richardson Foundation, the U.S. Department of Housing and Urban Development, the Chicago Community Trust, and the John D. and Catherine T. MacArthur Foundation, among others. She has served as president of the American Political Science Association's Urban Politics section and Information and Technology Politics section, chair of the International Political Science Association's research committee on Electronic Democracy and was elected a fellow in the National Academy of Public Administration in 2016.\nEducation\nPh.D. Political Science, Wayne State University 1996\nM.A. Political Science, Wayne State University 1992\nB.A. Honors Political Science (Summa Cum Laude), Wayne State University, MI 1991",
    "rights": "theconversation.com",
    "rank": 297,
    "topic": "news",
    "country": "AU",
    "language": "en",
    "authors": "",
    "media": "https://cdn.theconversation.com/avatars/2278122/width238/kmossber.jpg",
    "is_opinion": false,
    "twitter_account": null,
    "_score": 10.304856,
    "_id": "e03c899e32639f6c7abcb83c01f73624"
  },
  {
    "title": "Indo-Pacific: A blueprint for democracy in the digital age",
    "author": "",
    "published_date": "2024-12-16 15:41:14",
    "published_date_precision": "full",
    "link": "https://www.lowyinstitute.org/the-interpreter/indo-pacific-blueprint-democracy-digital-age",
    "clean_url": "lowyinstitute.org",
    "excerpt": "From political activism to cyberattacks, the rise of technology is changing the face of regional engagement.",
    "summary": "As years go, 2024 has been big on democratic reckoning, and the elections across the Indo-Pacific have shown how technology impacts almost every facet of the democratic process. From the cyberattacks in Palau in retaliation for its diplomatic ties with Taiwan, to the young activists in Bangladesh who used social media to organise mass protests calling for electoral reform, the region provides a blueprint for building more resilient democracies in the digital age.\nThe Indo-Pacific is an arena where the pressures of rapid digital transformation collide with diverse political systems, social structures, and economic realities. This makes it an excellent study of global challenges to democracy, and policymakers should pay attention. Five themes from the region offer a valuable new framework for analysis.\nDemocratic resilience amid digital transformation\nMany Indo-Pacific nations are grappling with how to safeguard democratic integrity in an era of rapid technological change. While not exhaustive, some issues include the use and impact of disinformation campaigns, the role of digital literacy in sustaining democratic norms, the erosion of trust in democratic institutions due to manipulated digital narratives, and the impact of emerging technologies (such as artificial intelligence) on political stability. For example, during South Korea's 2024 elections, deepfake videos were used to discredit political figures by fabricating corruption allegations, manipulating public perception and undermining democratic processes.\nTech-driven political engagement\nThe region has a large youth population that is highly engaged online. Digital platforms are shaping political discourse, enabling youth participation, and creating new channels for civil society engagement through social media. Digital tools and platforms have also enabled new forms of political assembly and activism, such as the youth-led movements in Bangladesh and Indonesia this year. However, tech-driven political engagement raises concerns over the spread of misinformation, manipulation of voters, regulation of political advertising online, and the potential for online platforms to influence political outcomes.\nCybersecurity and governance\nCybersecurity is a key challenge across the Indo-Pacific, as institutions, critical infrastructure, and digital governance systems are increasingly targeted. For example, Guam, a US territory in the Pacific Ocean, was under cyberattack by Chinese hacking group Volt Typhoon from 2021 to mid-2023. The intrusion was not for espionage, but for sabotage. Similarly, in March 2024, Chinese-state sponsored hackers conducted a cyberattack on Palau's finance ministry, disrupting the payment of 1,800 government employees, allegedly in retaliation for Palau's diplomatic recognition of Taiwan.\nThere is a marked contrast between the use of technology to enhance democratic governance in some parts of the region and the rise of digital authoritarianism in others.\nIndo-Pacific countries such as Australia, the United States and Japan are leading collaborative, multilateral efforts to establish robust cybersecurity frameworks, focusing on protecting electoral systems, mitigating cyberattacks on essential services, and fostering regional cooperation to address cross-border threats. However, gaps remain in achieving consistent standards across the region, with disparities in capacity and resource allocation hindering collective progress. Strengthening cybersecurity is not just about technology but also about trust, requiring transparent governance, public-private partnerships, and enduring multilateral engagement.\nDigital authoritarianism versus digital democratic norms\nThere is a marked contrast between the use of technology to enhance democratic governance in some parts of the region and the rise of digital authoritarianism in others. For example, while some countries are using technology to promote transparency and civic engagement, others are employing advanced surveillance technologies and data control to limit individual freedoms. The most aggressive example of this is China's export of advanced surveillance systems to monitor dissent and limit freedoms, through its 'Digital Silk Road', which forms part of its broader Belt and Road Initiative.\nDigital inequality and access to technology\nWhile some Indo-Pacific nations are advanced in terms of digital infrastructure and technology adoption, many others still face significant gaps. Uneven internet penetration, affordability of digital devices, and disparities in digital literacy are key challenges. In many countries, segments of the population remain excluded from the digital economy and political engagement, which affects economic development and worsens democratic inequalities. The digital divide can be exacerbated by age, gender, ethnicity, socioeconomic and educational barriers. Those without reliable access to technology are often left out of critical political discussions, online public spheres, and governance processes. Initiatives such as Tonga's undersea cable project are an important step forward in lessening the digital divide.\nIt has been a politically fraught year for many nations and as we reflect on 2024, resilience should serve as an inspiration for global democratic renewal. The Indo-Pacific, with its extraordinary diversity and interplay of political systems, economic realities, and technology, is a unique microcosm of the complex relationship between technology and democracy. The region offers valuable insights and a testing ground to guide policymakers, civil society, and international organisations and foster more resilient, inclusive and democratic societies in the digital age.",
    "rights": "lowyinstitute.org",
    "rank": 9477,
    "topic": "news",
    "country": "AU",
    "language": "en",
    "authors": "",
    "media": "https://www.lowyinstitute.org/sites/default/files/2024-12/Voting%20finger%20comp.jpg",
    "is_opinion": false,
    "twitter_account": "@lowyinstitute",
    "_score": 10.580136,
    "_id": "d04dd685eb4c48fadc8937d47f28b7d2"
  },
  {
    "title": "Deepfake Technology and Expectations of Celebrity Will Revolutionize Voting",
    "author": "Annika Chudzik",
    "published_date": "2024-12-11 23:25:03",
    "published_date_precision": "full",
    "link": "https://medium.com/@anichudzik/deepfake-technology-and-expectations-of-celebrity-will-revolutionize-voting-7d8f3446ea02",
    "clean_url": "medium.com",
    "excerpt": "The political appeal of a 'return to the way things once were' is one that can be both understood on a biological level and can also be…",
    "summary": "Image Source: University of Miami News\nThe political appeal of a 'return to the way things once were' is one that can be both understood on a biological level and can also be seen cycling itself through the weaving of history and politics. It is natural to feel unease at the things one does not understand, but it is necessary to remember that great men have been defined throughout history not simply through masterful, artistic works and scientific discoveries in times of prosperity, but also for their reaction to fear during times of chaos, despair and uncertainty. During these times, political polarization naturally rises as some welcome change with open arms, while others cry out with a desperation that seems to beg, 'Please do not sit idle by and watch in indifference as tradition and life as we have known it burns!' When new technology is unveiled to the world, however ready we believe ourselves to be, there is naturally fear that surrounds the creation itself, but there is also a more concealed fear of those who created it and those, if any, who wield the power to control it. For years, conspiracy and speculation has riddled even the most acclaimed political and well-known figures, creating distrust in both those that hold power and the concept of power itself. When the American Dream was alive and well, being a billionaire was seen by many as something illustrious, especially if it was a position that was attained not through legacy, but by climbing the metaphorical ladder through hard work and tenacity. Instead, today many Americans see this dream as more of a nightmare, one that is representative of how great the economic divide has grown between the classes, or rather, how great the sentiment of 'what those in power allow us to know and do' grows. As billionaire becomes synonymous with greed and greed becomes synonymous with politician, the people of the working class still desire idols that set their political fire ablaze, and recently, these figures have been everyone from stars of the silver screen to influencers selling face cream. As politicians have started to understand the power of leveraging celebrity star quality for votes, one must begin to wonder if Generative A.I. technologies like Deepfake will begin to cause a sense of distrust in the famous figures people feel akin to, if the risks of this new technology pose a threat to the integrity of voting, and if we have opened yet another Pandora's Box.\nTo say that people currently do not already question the legitimacy and integrity of voting in America would be a fallacy. Following rumblings of Russian interference in the following few elections, as well as alleged voter suppression, to allegations of ballots being thrown out, one can confidently say that there is largely a distrust in both the way American voting is conducted, as well as a distrust in the security and stability of the technologies that control online voting. At the same time, politics are shifting into a way of life, with many believing that everything from the place that they buy their coffee to the person that they watch on their favorite show should share in their political beliefs. The perspective of political interest being reflective of one's morality, ethics and personhood is a somewhat new concept and as people try to navigate a social and political landscape that changes seemingly daily, many look to others to determine how to feel about the world around them. Unlike a time when people felt most influenced by those closest to them environmentally, such as family or community members, mobility and deculturization through social platforms allow for the spread of ideas that have led young people to look to the political opinions of those that inspire them in other mainstream senses, like singers, actors and even influencers. One might ask, 'Why is it required of Chappell Roan to endorse a specific political candidate if she has no political affiliation?' 'Why is it that Taylor Swift endorsing Kamala Harris can result in massive voter turn-out despite the singer having no history in politics?' Ultimately, young people today feel more connected to stars than ever before due to the ubiquitousness of social media and the prevalence of one-sided, parasocial relationships, which allow young people to feel connected to the artists that inspire them in a way that is both inspiring and potentially dangerous.\nIt is not atypical that younger generations feel represented by the art that is forged out of political events. Some of the most influential artists of the past, including Elvis, The Beatles, and Michael Jackson, gained popularity and sentimentality with fans through their ability to not just make music that entertained, but also through speaking on some of the pressing political issues of their time. The main difference is, many of these artists had a connection to the issues they spoke on, and the implication that every celebrity must take a stance on every political issue that arises is one that leaves many wondering if their voices speak with intention. It is also critical to note that it is not feeling connected to artists that is inherently problematic, but rather the illusion of intimacy that social media has created and the extent of access we have to public figures. Parasocial relationships are defined by The Guardian as 'Intense- and crucially, one-sided — attachments to celebrities or public figures' (The Guardian). These attachments can be unhealthy if taken too far, but apart from the issues they can create for the person on the opposing side of the relationship, individuals should be encouraged to think freely, do their own independent research and come to their own conclusions about political candidates and figures regardless of endorsements.\nAs artificial intelligence like Deepfake technology increases in its prevalence, it is unknown whether public figures will feel increasingly or less inclined to speak out on political issues. One celebrity who was recently implicated in an unwanted political Deepfake was Taylor Swift, who combated this by endorsing the opposing candidate of the Deepfake she falsely appeared to endorse. An article by Cyberscoop details Swift's response, writing, 'Recently I was made aware that AI of 'me' falsely endorsing Donald Trump's presidential run was posted to his site,' Swift wrote in an Instagram post officially endorsing Harris. 'It really conjured up my fears around AI, and the dangers of spreading misinformation.' (Cyberscoop). She also added that 'The simplest way to combat misinformation is with the truth' (Cyberscoop). With Swift being both one of the richest and most powerful people on the planet, as well as a victim of a Deepfake attack that many believed, it should be even more plausible that this type of technology can implicate anyone and everyone. Although many report believing they can detect when material has been generated or tampered with by artificial intelligence, a vast amount of research supports that generally, people are only correct around half the time. Ultimately, the President-Elect of the United States is unable to tell a video is a Deepfake and artificial intelligence capabilities are only improving, we must stop believing that we understand and can identify when and where this technology is being used and the full implications it.\nDue to the novelty of generative artificial intelligence, there is little regulation surrounding the technology despite hundreds of millions of people already having access to it and '27% of Americans [saying] they interact with AI at least several times a day' (Pew Research Center). This poses several risks, as there are few ways to curb, manage or regulate how the tech is used and who is using it. According to a brief titled The Rise of Artificial Intelligence and Deepfakes, Deepfake technology has wide-ranging implications beyond international security, including the fabrication of criminal evidence, new forms of sexual harassment including deepfake pornography and/or privacy violations from employers trying to prevent [them] from happening in the first place' (Buffett Brief). Anytime new technology is introduced, there is a need for regulation surrounding it, but because of the nature of artificial intelligence and its ability to adapt and learn, as well as the possibly for it to be weaponized on a large scale, it has the ability to change the systems that have already been in place for centuries. The practice of law, for example, will need to adapt to the artificial intelligence age following the invention of Deepfake technology as it improves. As Deepfake technology becomes more prevalent and we can more accurately assess how at risk we are of the possible negative implications, life will look incredibly different. I predict we will need accurate artificial intelligence detection involved in the legal process to ensure that evidence provide in testimony is authentic and hasn't been artificially tampered with. As technological progress continues to occur in relation to artificial intelligence and Deepfake technology, I predict we will also see the amount of fear related to the technology increase, as well as, like I mentioned earlier, an increase in traditionalism. Once we become acquainted with Deepfake tech and can properly regulate how it is used, at least to the best of our abilities, we will see this cultural backlash even out.\nWe are currently seeing the backlash to power structures in ways unlike ever before. Technology and its progression allows people autonomy as well as anonymity, two things many feel that they have been stripped of by those in high positions of power. Similar to the internet, artificial intelligence may provide individuals with freedoms they feel like they lack, as when there is a lack of surveillance and regulation, people may tend to think they are more in alignment with their truer, unfiltered self. I believe this to be a fallacy. I theorize that when people feel they can act in a way unfiltered by the ethics and rationality of humanity due to lack of a fear of consequence, they are often in alignment with the worst sides of themselves, the darker inclinations that we all have inside of us, the ones that we grow to learn to suppress. It is for this reason that regulation of Deepfake regulation is so important, for if it ends up in the wrong hands, as it likely already has, there is no telling the harm that could be done.\nThe quality of our environment and climate change will also impact how we utilize Generative Artificial Intelligence, and vice versa. According to the National Assessment Governing Board, 'Some technological decisions put environmental and economic concerns in competition with one another, while others have positive effects for both the economy and the environment' (NAGB). The idea that technology is having a profoundly negative impact on the environment is misleading and there are several factors to take into account when considering how technologies like generative artificial intelligence could affect the environment. For example, prompting gen A.I. may be a way to find solutions to some of the larger problems at hand that we have yet to solve when looking to improve climate change, and on an even smaller scale, Gen A.I. is already being used by everyday people to incorporate more sustainability into their daily lives and to learn more about climate change initiatives. For example, according to PwC , 'GenAI could help drive decarbonization' (PwC) and 'has the potential to make operations more carbon efficient' (PwC). We must not look at new technologies and the risks they pose as entirely negative, but also realize that they provide a host of opportunities to our changing world.\nDeepfake is also being increasingly featured and seen in the media and on television, likely to grow familiarity on a widespread scale. One specific Black Mirror episode touches heavily on potential risks of unregulated Deepfake intelligence, with BBC touching on the episode, writing, 'US media has been quick to point out that the recent series six episode 'Joan Is Awful' sees Hollywood star Salma Hayek grapple with the discovery that her AI likeness can by used by a production company without her knowledge' (BBC). The message of the dystopian episode? Perhaps this is a subtle way of warning that if those in positions of power can be victimized by unregulated A.I. tech, we are all at risk of being in the same dire position. I predict more pop culture moments such as these, subliminally warning of potential negative implications, most likely not to instill fear, but instead to create awareness of generative artificial intelligence and desire for more regulation overall.\nWhile Deepfake technology has already been created and is being used in a diverse number of ways, one of the only ways fathomable that would stop the technology from growing and evolving is if there was some way to destroy it altogether. Another way that comes to mind is if there was regulation that created heavy restrictions on who could use the technology, but as has been seen numerous times before, where regulation occurs, there will still be those who will make an effort to illegally purchase or use what is being restricted from them. Some claim that the only way to truly ensure a free and equal world is a world free of all regulation, but I am certainly not one of those people. I believe that the future of Deepfake regulation will be largely determined by the actions that individuals take over the next few years, how the technology is generally used, if it is being weaponized, and which people are primarily being targeted by Gen A.I. weaponization.\nI predict that the evolution of Deepfake technology will not only require new methods for how law and order is observed and proven but will also lower the amount of social responsibility and expectation we place on public figures to endorse political candidates and openly share their political opinions. I believe the introduction of Gen A.I. will also lower trust in the security of voting in America, perhaps on a slightly smaller scale, and finally, I believe it will encourage people to be more authentic on social platforms and in their everyday lives. As Generative Artificial Intelligence improves and evolves, what we currently define as reality may become indistinguishable from the glamor of modern technology. It may be time for us to change our perspective. Perhaps Artificial Intelligence is not the weapon that is changing what we define as real and fake, but rather, it is casting an even brighter spotlight on the fact that we can never fully know the interior makings from the shiny exterior a person projects. Truth is becoming increasingly hard to separate from falsehood, but perhaps it always has been. The new technological era will require us not only to reevaluate the people we truly are behind the masks of our social veneer, but also the values we hold true and, most importantly, who we want to be moving forward.\nBy: Annika (Ani) Chudzik\nSources:\nB. effects of technology on the natural world . B. Effects Of Technology On The Natural World. (n.d.). https://www.nagb.gov/naep-subject-areas/technology-and-engineering-literacy/framework-archive/2014-technology-framework/toc/ch_2/society/society2.html#:~:text=4.5%3A%20The%20use%20of%20technology,of%20energy%20and%20raw%20materials.\nGuardian News and Media. (2022, February 13). Too close for comfort: The pitfalls of parasocial relationships . The Guardian. https://www.theguardian.com/media/2022/feb/13/too-close-for-comfort-the-pitfalls-of-parasocial-relationships\nJohnson, D. (2024, September 11). Taylor Swift calls out AI deepfakes in Harris endorsement . CyberScoop. https://cyberscoop.com/taylor-swift-ai-deepfake-trump-post-kamala-harris-endorsement/\nKennedy, B. (2023, February 15). Public awareness of artificial intelligence in Everyday Activities . Pew Research Center. https://www.pewresearch.org/science/2023/02/15/public-awareness-of-artificial-intelligence-in-everyday-activities/\nMcCallum, S. (2023, July 14). The Black Mirror plot about AI that worries actors . BBC News. https://www.bbc.com/news/technology-66200334\nPricewaterhouseCoopers. (2024, January 16). How generative AI model training and deployment affects sustainability . PwC. https://www.pwc.com/us/en/tech-effect/emerging-tech/impacts-of-generative-ai-on-sustainability.html\nThe Rise of Artificial Intelligence and Deepfakes. (2023, July). https://buffett.northwestern.edu/documents/buffett-brief_the-rise-of-ai-and-deepfake-technology.pdf",
    "rights": "medium.com",
    "rank": 58,
    "topic": "entertainment",
    "country": "US",
    "language": "en",
    "authors": "https://medium.com/@anichudzik,Annika Chudzik",
    "media": "https://miro.medium.com/v2/resize:fit:940/1*HbS2jS8iZ668xPan8ssVtA.jpeg",
    "is_opinion": false,
    "twitter_account": "@Medium",
    "_score": 10.308531,
    "_id": "ea5a6e56c70b82009c83dd3f78de9f0b"
  },
  {
    "title": "How technological change made rural America conservative",
    "author": "",
    "published_date": "2024-12-16 10:10:19",
    "published_date_precision": "full",
    "link": "https://blogs.lse.ac.uk/usappblog/2024/12/16/how-technological-change-made-rural-america-conservative",
    "clean_url": "lse.ac.uk",
    "excerpt": "Following the Dust Bowl, the introduction of new irrigation technology led to a regional shift away from small firms to large business-like operations, creating a new rural power elite whose interests aligned with conservative politics and promoted conservative values to the broader population.",
    "summary": "Until World War II, much of what are now strongly conservative areas in rural America supported progressive causes. In new research, Aditya Dasgupta investigates the role of technological change in influencing rural politics during the 20th century. He finds that following the Dust Bowl of the 1930s in the Great Plains, the introduction of new irrigation technology led to a regional shift away from small firms to large business-like operations. This in turn created a new rural power elite whose interests aligned with conservative politics and promoted conservative values to the broader population.\nOne need only look at a map of the 2024 presidential election results to know that rural areas are strongholds of conservative politics in the United States. Indeed, simple visual cues of rurality, such as the relative number of pickup trucks on the streets, are highly informative about the Republican party's local vote share.\nBut this wasn't always the case. Historically, rural regions in the United States like the Great Plains – the vast grassland spanning the ten states stretching from Texas in the South to the Dakotas in the North – were often hotbeds of progressive movements. Indeed, in this region, the left-wing Populist movement once thrived in the early twentieth century.\nSo, what changed in the last century to make a region that was historically centrist, if not left wing, in its politics into a conservative stronghold? In recent research, I explore a surprising factor behind this transformation: the introduction of new irrigation technologies after World War II, which not only remade the rural economy but also its politics.\nFrom Dustbowl to Breadbasket\nThe Great Plains has long been a center of American agriculture, but its arid climate posed immense challenges to farming. In the 1930s, years of drought and dust storms, which became known as the 'Dust Bowl' devastated the region, driving many farmers from their land. Those who stayed relied on dryland farming, which was precarious and unproductive. By the mid-20th century, many family farms were on the brink of collapse.\nEverything changed after World War II. Two groundbreaking innovations—petroleum-powered deep well pumps and center-pivot irrigation systems—unlocked the potential of the Ogallala Aquifer, one of the largest groundwater reserves in the world. These technologies allowed farmers to irrigate vast areas, transforming the Great Plains into one of the world's most productive agricultural regions.\nBut there was a catch. These technologies were expensive, favoring large-scale operations over traditional family farms. Over time, the region's agriculture shifted toward capital-intensive agribusiness. This economic shift had profound political consequences. Before the irrigation boom, farmers in the Great Plains often supported progressive policies, favoring government intervention to stabilize crop prices and provide a safety net. But as small farms were replaced by large, business-like operations, political preferences shifted dramatically.\nTo investigate how economic change resulted in political change, we turned to a fascinating reservoir of qualitative data: repeated community studies by rural sociologists carried out in Haskell County in Kansas over a 50-year period spanning the pre- and post-technological shock periods. Drawing on these studies, we highlight three inter-related mechanisms through which the introduction of irrigation technology after World War II seems to have transformed politics:\n1. Selection for Scale: The displacement of small farmers\nIn Haskell County, the advent of irrigation technology brought immense productivity gains but came at a steep cost. The high expense of deep-well pumps and center-pivot irrigation systems required substantial upfront investments, favoring wealthier landowners who could afford the capital outlay. Sociologists observing the region noted that small family farmers, already struggling to stay afloat, found themselves unable to compete. Many sold their land to larger operators, further concentrating agricultural production.\nThis shift in landownership created a new rural elite composed of large-scale agribusiness operators. These landowners, concerned with protecting their profits and minimizing costs, increasingly aligned with conservative political platforms that emphasized low taxes and reduced government regulation.\n2. Agglomeration Effects: The rise of agribusiness\nThe economic ripple effects of irrigation went beyond the farm. As irrigation-supported monoculture farming, particularly corn, took hold, Haskell County became a hub for downstream industries such as meatpacking and cattle feedlots. These industries, which relied on the steady supply of irrigated corn for animal feed, entrenched the dominance of agribusiness in the local economy.\nThe sociologists noted that this economic agglomeration reshaped the region's labor force and community dynamics. The influx of agribusiness-related jobs brought significant economic growth, but also tied the fortunes of the county tightly to the success of large-scale agriculture. Politically, this dependency further strengthened the influence of agribusiness leaders, who lobbied for policies favorable to their industries.\n3. The emergence of an influential rural power elite\nPerhaps the most striking transformation observed in Haskell County was cultural. The sociologists documented how the new rural elite—wealthy landowners and agribusiness elites—actively shaped political and social norms. Their emphasis on self-reliance, free enterprise, and skepticism toward government intervention resonated deeply in a community that was oriented around collective action and farmer cooperatives.\nOver time, these values trickled down to the broader population, even among those who did not directly benefit from agribusiness wealth. The studies highlight how church groups and civic organizations echoed the conservative messaging promoted by these elites, reinforcing a cultural shift away from the more progressive politics of the past. Agribusiness lobbying organizations, like the Farm Bureau, also promoted conservative politicians and messaging through campaign contributions.\nComparing counties shows the impact of new irrigation technology\nTo test the theory, I analyzed county-level voting patterns across the Great Plains before and after the irrigation boom. By comparing counties above the Ogallala Aquifer to nearby counties without groundwater access, we identified a clear pattern: areas that benefited most from the new technologies became significantly more conservative over time.\nWe also examined individual attitudes using survey data. People in areas transformed by capital-intensive agriculture are today more likely to oppose government regulation and redistributive policies, reflecting the growing influence of agribusiness, even when comparing those who lived nearby but across the boundary of the Ogallala aquifer.\nNew technologies can change society and politics\nOur findings highlight how economic and technological changes can reshape political landscapes. The conservative transformation of the Great Plains was not just about cultural issues or 'what's the matter with Kansas' as journalist and historian Thomas Frank famously queried in 2004. It was also about the rise of agribusiness and the economic incentives that came with it.\nUnderstanding these dynamics is crucial as we face new technological and environmental challenges. Just as irrigation transformed the Great Plains, innovations in automation, renewable energy, and climate adaptation could reshape political preferences in the future.\nThe story of the Great Plains offers a powerful lesson: new technologies don't just change economies—they change societies and politics, too. By examining the past, we can better understand the forces shaping our political future.",
    "rights": "lse.ac.uk",
    "rank": 981,
    "topic": "news",
    "country": "GB",
    "language": "en",
    "authors": "",
    "media": "https://blogsmedia.lse.ac.uk/blogs.dir/58/files/2024/12/Irrigation-flickr-747x420.png",
    "is_opinion": false,
    "twitter_account": "@LSEUSAblog",
    "_score": 10.631419,
    "_id": "5d32fae1c8260711ce566de560b2dff3"
  },
  {
    "title": "Tonight with Andrew Marr 13/01",
    "author": "Olly Roberts",
    "published_date": "2025-01-13 22:46:17",
    "published_date_precision": "full",
    "link": "https://www.lbc.co.uk/radio/presenters/andrew-marr/tonight-with-andrew-marr-13-01-25-watch-again",
    "clean_url": "lbc.co.uk",
    "excerpt": "You can watch Monday's Tonight With Andrew Marr in full here.",
    "summary": "Tonight with Andrew Marr 13/01 | Watch Again\nTonight with Andrew Marr 13/01 | Watch again\nBy Olly Roberts\nYou can watch Monday's Tonight With Andrew Marr in full here.\nListen to this article\nLoading audio...\nAndrew Marr was joined by:\nNatasha Clark : LBC Political Editor\n: LBC Political Editor Peter Kyle : Secretary of State for Science, Innovation and Technology\n: Secretary of State for Science, Innovation and Technology Baroness Brown (Julia King) : British engineer and Chair of the House of Lords Select Committee on Science and Technology\n: British engineer and Chair of the House of Lords Select Committee on Science and Technology Dr. Jeevun Sandher : Labour MP for Loughborough\n: Labour MP for Loughborough Dr. Adrian Boyle : President of the Royal College of Emergency Medicine\n: President of the Royal College of Emergency Medicine Aggie Chambre : LBC Political Correspondent\n: LBC Political Correspondent Adam McKay : Director of Don't Look Up, The Big Short, and the Anchorman series\n: Director of Don't Look Up, The Big Short, and the Anchorman series Gina Davidson : LBC Scotland Political Editor\n: LBC Scotland Political Editor Alan Zycinski : LBC Scotland Correspondent\n: LBC Scotland Correspondent Sir Craig Oliver: Former Downing Street Director of Communications and Partner at FGS Global\nWatch Tonight with Andrew Marr exclusively on Global Player every Monday to Thursday from 6pm to 7pm.",
    "rights": "lbc.co.uk",
    "rank": 7851,
    "topic": "news",
    "country": "GB",
    "language": "en",
    "authors": "Olly Roberts",
    "media": "https://images.lbc.co.uk/images/698808?width=1200&crop=16_9&signature=ozSzpbBlas2nbk9oMAqxbp4W9bM=",
    "is_opinion": false,
    "twitter_account": "@lbc",
    "_score": 10.257281,
    "_id": "cce4c94a41da5c6c3527cab5bd5fa2e3"
  },
  {
    "title": "Who will serve the unmet political needs created by the AI revolution?",
    "author": "David Coletto",
    "published_date": "2025-01-26 13:13:56",
    "published_date_precision": "full",
    "link": "https://davidcoletto.substack.com/p/who-will-serve-the-unmet-needs-created",
    "clean_url": "substack.com",
    "excerpt": "The \"Tech Right\" and the emerging need for political and policy solutions",
    "summary": "I'm been thinking a lot lately about what AI and automation is going to mean for politics.\nRecent surveys I've done suggest that Canadians are increasingly torn between the promise of technological innovation and the potential disruption it poses for traditional industries and jobs. For example, only 39% think making Canada an AI superpower would make them better off.\nManufacturing, natural resource, retail, public services, and other similar (legacy) sectors have long been the backbone of Canada's workforce, providing stable employment and a sense of economic security. Yet, the rapid emergence of the 'Tech Right'—entrepreneurs and innovators who advocate for freer markets, minimal regulation, and a government that is agile and tech-savvy—is shifting our political conversation. They clearly have influence within Pierre Poilievre's sphere and he likely shares many of their views. This new faction's influence raises pressing questions about the future of work, consumer benefits, and the balance between progress and stability.\nHistorically, Canada's labour movements and parties, such as the CCF and later the NDP, emerged to protect workers from the upheavals of industrialization. Widespread access to the franchise and the resulting political empowerment helped shape policies around labour rights, social welfare, and equitable growth. Now, rapid advancements in automation and artificial intelligence threaten similar upheavals in a post-industrial economy. Workers in manufacturing and retail may be displaced by technological solutions that promise efficiency and lower costs for consumers. At the same time, these technologies can drive down prices, speed up service delivery, and expand consumer choice.\nThis paradox—where some benefit from cheaper goods and services while others see their jobs replaced or transformed— creates a new set of political demands.\nThese include calls for modernized social safety nets, faster reskilling programs, and strategic partnerships between government, industry, and educational institutions. Voters are looking for leadership that can balance the benefits of innovation with the need for job security and social stability. For many, the old 'labour vs. business' political framework seems mismatched to the complexities of a tech-driven landscape.\nThat is where the 'Tech Right' offers both potential and peril. On one hand, it brings fresh thinking about how to streamline government services, improve state capacity, and leverage technology to address policy bottlenecks (such as interprovincial trade barriers or immigration backlogs). If done well, consumers and workers could see tangible benefits in the form of more efficient public programs, faster approvals, and new channels for economic growth. On the other hand, these innovators may downplay the disruption their technologies cause in traditional sectors, leaving many workers anxious and unprepared for a shifting economy.\nThe question facing Canadian politics is whether any existing party or coalition can champion this new social contract: one that embraces tech-driven growth while ensuring that workers and communities are not left behind.\nSome Conservatives see an opening to unite pro-market technology enthusiasts with working-class voters by promising job creation in emerging industries. Liberals and New Democrats may attempt to integrate these tech-friendly policies within a broader agenda of equity, environmental sustainability, and worker protections.\nWhat is clear is that a new generation of voters—raised on smartphones and increasingly skeptical of outdated economic models—expects pragmatic solutions that harness technology without sacrificing fairness. Parties that can articulate this balanced vision will have an edge. Whether it emerges from within an existing political movement or spurs the creation of a new one, this alignment of tech-driven optimism with worker-focused policy could reshape Canada's political landscape in the coming decade.",
    "rights": "substack.com",
    "rank": 278,
    "topic": "news",
    "country": "US",
    "language": "en",
    "authors": "David Coletto",
    "media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fde309118-08b7-41da-b35b-20dacb44fe15_584x579.png",
    "is_opinion": false,
    "twitter_account": null,
    "_score": 10.228091,
    "_id": "f3011c2f20eb757f72ef5e1e56d2593d"
  },
  {
    "title": "The problem is in the political elite, not in the technology of reporting election results",
    "author": "FAKTI.BG",
    "published_date": "2025-01-08 12:17:56",
    "published_date_precision": "full",
    "link": "https://fakti.bg/en/mnenia/940105-problemat-e-v-politicheskia-elit-a-ne-v-tehnologiata-na-otchitane-na-izbornite-rezultati",
    "clean_url": "fakti.bg",
    "excerpt": "Comment by Stanislav Todorov The obsession with the technology of reporting election results (by the PP-DB) shows the exhausted ideological basis of political parties. Te",
    "summary": "publishes opinions with a wide range of perspectives to encourage constructive debates.\nThe obsession with the technology of reporting election results (by the PP-DB) shows the exhausted ideological basis of political parties. Technological changes will not increase trust in the political system and election procedures, respectively, nor trust in political parties. If election technology works for the opposing camp (for GERB and company), this is also a symptom of the ideological impotence of political subjects - the democratic race is won through election technology, not through an ideological clash. In other words, our democracy is simply a technology for reporting election results, some master the technological process, while others do not, which is why the disputes are in this field.\nIf our political elite understands democracy in this way, as a struggle for the method of technological reporting of election results, then the problem is not in the election technology, but in the political elite.\nElections should perform a selective function - to provide the opportunity for people to select significant political proposals and representatives who are capable of defending them.\nIf elections do not perform a selective function, because there are no significant political proposals, and one of the reasons for the election results is purely technological, then the problem is not in the technology. We have a political elite that does not produce significant competing ideas, but competes in the field of pure procedure (how the technology for reporting election results should work).\nThe problem is in the political elite, not in the technology. We need to change the political elite, not the technology of broadcasting it.",
    "rights": "fakti.bg",
    "rank": 109559,
    "topic": "news",
    "country": "BG",
    "language": "en",
    "authors": "FAKTI.BG,Fakti",
    "media": "https://cdn4.focus.bg/fakti/photos/fb/2b2/problemat-e-v-politicheskia-elit-a-ne-v-tehnologiata-na-otchitane-na-izbornite-rezultati-1.webp",
    "is_opinion": false,
    "twitter_account": null,
    "_score": 10.505185,
    "_id": "b545787781cd68f5713a607c2bda0d6d"
  },
  {
    "title": "Global power politics",
    "author": "Dr Talat Shabbir",
    "published_date": "2024-12-20 00:00:00",
    "published_date_precision": "date",
    "link": "https://www.thenews.com.pk/print/1263365-global-power-politics",
    "clean_url": "thenews.com.pk",
    "excerpt": "In the global arena, power politics refers to the continuing competition among states for influence, economic might, and strategic supremacy, which essentially means pursuing national interests.A...",
    "summary": "In the global arena, power politics refers to the continuing competition among states for influence, economic might, and strategic supremacy, which essentially means pursuing national interests.\nA recent example of a global power struggle could be the World Wars and the power struggle that followed to shape an international system. The bipolar world order that emerged after the Second World War dominated by the US and the Soviet Union is defined as an era of proxy wars and nuclear deterrence.\nThe post-cold war period saw the rise of emerging powers asserting themselves in the international system by transitioning from regional power struggles to global competition. The complex interplay of economic dominance, military might, shifting power centres, and technological advancements defines the broader contours of current power politics in the international system.\nThe current world order is shaped by the ascent of multiple actors to political and economic power, technological advancement, economic globalisation, and geopolitical conflicts as countries compete for supremacy in soft power, military, and the economy.\nDespite growing nationalism and regionalism, organisations such as the United Nations, World Bank, and IMF continue to offer forums for multilateral discussion and extend help and assistance to nations who direly need it. There is an increasing realisation of collective obligations to address global issues including inequality, cybersecurity, and climate change, yet conflicting interests and power struggles hamper cooperation.\nThe key actors in the current global power politics are the US, China, Russia, the European Union, and emerging powers such as India and Brazil. The US continues to be a powerful nation with unmatched military might, a strong economy, and an extensive international alliance network that gives the US the capacity to exert influence across continents.\nChina's extraordinary rise reflects its geopolitical aspirations, while its Belt and Road initiative, enormous trade networks, and technological innovations are transforming the world economy. Russia retains its influence through its military capability, energy resources, and strategic positioning and is an effective counterweight to Western hegemony.\nThe European Union's political integration and economic might is a unifying factor in global governance despite opposing ideas of member states with regard to various ongoing conflicts. India, Brazil, and other emerging nations have a profound impact on the changing world politics. While South Africa and Brazil are raising the voices of the Global South, India's strategic significance in the Asia-Pacific and its projection as a net security provider enhances its stature in the region. Collectively, these actors contribute to addressing global challenges like climate change, security, and economic inequality.\nIn global power politics, major drivers of influence are military power, economic clout and use of soft power. Military power remains critical and serves both as a deterrent and a tool for enforcing strategic interests. In addition to military influence, economic power and soft power provide means of influencing the world order. States can exercise influence through economic power that can be fuelled by trade and investment. By establishing appeal via culture, soft power draws other countries to align and all combined, these drivers help countries negotiate the high seas of power politics.\nFactors defining the current structure of global power politics are the US-China competition, global instability, the geopolitics of energy, the weaponisation of trade and technology, and the crisis of global governance. The US and China compete for supremacy in the fields of technology, economics, and the military.\nWhile China has been enduring to establish itself as a worldwide powerhouse for economic development, the US places a higher priority on preserving its position as the world's leading nation. If the competition intensifies, it will have far-reaching implications for global trade, regional stability, and the future of international relations.\nGlobal instability has intensified in recent years, driven by conflicts such as the ongoing war in Ukraine, which has strained global politics and exacerbated tensions between Russia and the West. In the Middle East, the enduring conflict has deepened humanitarian crises and fuelled regional rivalries, disrupting economies and posing a challenge to international peace.\nGlobal dynamics are further shaped by the geopolitics of energy and the weaponisation of trade and technology. Traditional energy sources are challenged by the move to renewable energy sources, which means empowering those who own minerals essential to green technologies. Countries are fast learning to use technological and economic instruments for geopolitical ends. An emerging global governance crisis would make things worse. With growing nationalism and rival blocs, organisations like the UN and WTO also face difficulties.\nIn the current global power politics, navigating global issues entails balanced strategic diplomacy, collaboration, and adaptability. To address shared challenges, such as climate change, economic instability, and security threats, nations must foster multilateral dialogue.\nIt is imperative to leverage international institutions like the UN to enhance thought processes, collective action, and legitimacy. Fairness, mutual respect, and a commitment to equitable solutions are crucial to promoting a stable, rules-based just international system. Surely, there is a call to ensure a stable, inclusive, and prosperous world.\nThe writer is the director of the\nChina-Pakistan Study Centre at the",
    "rights": "thenews.com.pk",
    "rank": 4993,
    "topic": "news",
    "country": "PK",
    "language": "en",
    "authors": "Dr Talat Shabbir",
    "media": "https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-20/1263365_080619_updates.jpg",
    "is_opinion": false,
    "twitter_account": "@Dr Talat Shabbir",
    "_score": 10.298885,
    "_id": "fd8b3b51b4e995f682ce63e636c9d7d3"
  },
  {
    "title": "The Influence of Technology on Political Campaigns and Elections",
    "author": "Mohsin Liaqat",
    "published_date": "2024-12-03 10:35:49",
    "published_date_precision": "full",
    "link": "https://medium.com/@ch.mohsinliaqat20/the-influence-of-technology-on-political-campaigns-and-elections-7e838c752a69",
    "clean_url": "medium.com",
    "excerpt": "In the 21st century, technology has become an indelible part of political campaigns and the election process. Its influence has transformed the way political candidates communicate with voters, the…",
    "summary": "The Influence of Technology on Political Campaigns and Elections\nMohsin Liaqat\n·\nFollow\n21 min read\n· Just now\nJust now\n--\nShare\nPhoto by ThisisEngineering on Unsplash\nIn the 21st century, technology has become an indelible part of political campaigns and the election process. Its influence has transformed the way political candidates communicate with voters, the way elections are managed, and the way people interact with democracy itself. From social media platforms and data analytics to artificial intelligence (AI) and digital voting systems, technology has not only increased the efficiency of campaigns but also raised important ethical, privacy, and security concerns. This article delves deeper into the ways in which technology influences political campaigns and elections, addressing both the opportunities it presents and the challenges it creates.\n1. Digital Campaigning: The Rise of Social Media and Online Platforms\nSocial media has fundamentally changed political campaigning, allowing politicians to connect with voters in ways that were once unthinkable. Platforms like Facebook, Twitter, Instagram, TikTok, and YouTube have become indispensable tools for political engagement, outreach, and advocacy. These platforms provide a direct channel to voters, enabling candidates to communicate their messages without the filters of traditional media outlets.\nIn the past, political candidates relied heavily on television, radio, and print media for their…",
    "rights": "medium.com",
    "rank": 58,
    "topic": "business",
    "country": "US",
    "language": "en",
    "authors": "Mohsin Liaqat",
    "media": "https://miro.medium.com/v2/da:true/resize:fit:1200/0*7tXhQEY_DqEanbAH",
    "is_opinion": false,
    "twitter_account": "@Medium",
    "_score": 10.939684,
    "_id": "a50dff617be36001b38ee5217d657796"
  },
  {
    "title": "(EDITORIAL from Korea Times on Jan. 24)",
    "author": "최경애",
    "published_date": "2025-01-24 07:01:06",
    "published_date_precision": "timezone unknown",
    "link": "https://n.news.naver.com/mnews/article/001/0015178987",
    "clean_url": "naver.com",
    "excerpt": "dailies-editorials (2) Race for AI dominance Lesson in AI innovation vs. political turmoil In the ever-advancing field o",
    "summary": "dailies-editorials (2)\n(EDITORIAL from Korea Times on Jan. 24)\nRace for AI dominance\nLesson in AI innovation vs. political turmoil\nIn the ever-advancing field of artificial intelligence (AI), global powers are vying for dominance, with the United States under President Donald Trump leading the charge. The U.S. has unveiled a groundbreaking $500 billion investment plan to establish the infrastructure needed to propel AI to the forefront of the global economy.\nThe centerpiece of this initiative is the \"AI Manhattan Project,\" which includes a massive data center housing a supercomputer called \"Stargate.\" Set to be completed by 2028, this project is being driven by major tech players, including OpenAI, Oracle and SoftBank, with further contributions expected from Microsoft, Nvidia and Arm. Trump's administration has positioned this investment as the largest AI infrastructure program in history, promising to create over 100,000 jobs and secure the U.S.' leadership in next-generation technologies.\nThis ambitious plan represents more than just a technological leap — it is a strategic move to secure national competitiveness in the AI race. Trump's approach is grounded in deregulation and a focus on innovation.\nFrom Day 1 of his presidency, he has prioritized swift, decisive actions to secure energy supplies, recognizing the need for robust infrastructure to support technological growth. His administration's focus on energy security, combined with its push for AI innovation, exemplifies a model of governance that prioritizes long-term growth over regulatory obstacles.\nHowever, this aggressive stance stands in stark contrast to the situation in Korea. Last September, the Korean government outlined its own ambitious AI vision, seeking to become a global leader in AI. A national AI committee was formed under President Yoon Suk Yeol to spearhead this initiative.\nYet, despite these lofty goals, political instability has severely hindered progress. The committee has been largely inactive since Yoon became embroiled in controversy and taken into temporary custody, following his failed martial law declaration and subsequent impeachment proceedings. These political challenges have resulted in a major slowdown of the country's AI ambitions.\nKorea's vision for AI includes a joint public-private investment of 2 trillion won ($1.4 billion) to build an AI computing center, which is expected to facilitate AI research and development across universities, research institutes and startups.\nHowever, there are growing concerns about the feasibility of this plan, especially when compared to the U.S. initiative. South Korea's efforts are now at risk of falling short of expectations, particularly given the political instability and logistical challenges such as delays in energy infrastructure projects. Political squabbles over nuclear power plant construction and electricity distribution issues exacerbate the problem further.\nThe Korean situation illustrates the dangers of excessive political gridlock and the failure to act decisively in a rapidly evolving technological landscape. While the U.S. embraces innovation and aims to build an AI ecosystem without being hampered by overregulation, Korea's progress is stymied by infighting and delays in critical infrastructure development. The key takeaway is clear: to compete in the AI race, nations must set aside political differences and act swiftly to implement their technological visions.\nKorea is not alone in facing this dilemma. China has been taking a contrasting approach, expanding its AI capabilities aggressively. In both China and the U.S., government action is seen as central to fostering innovation, with significant investments and clear policies that facilitate rapid technological advancement. In contrast, countries like Korea, bogged down by internal political struggles, risk falling behind in the race for AI supremacy.\nTo avoid such a fate, Korea — and other countries facing similar challenges — must refocus on what matters: advancing AI development and fostering a competitive, innovative environment. This means minimizing political interference, ensuring the stability of the regulatory environment and prioritizing infrastructure development. Political leaders must be willing to make bold decisions for the long-term benefit of the nation, rather than succumbing to short-term political pressures.\nThe AI revolution is not just about technology; it's about economic security and global leadership. The U.S. is taking decisive steps toward securing its future in this rapidly evolving field, while Korea risks being left behind due to its political deadlock. The lesson is clear: to stay competitive, nations must put innovation first, leaving political squabbles in the past. Only then can they hope to harness the full potential of AI to secure their place in the global economy.",
    "rights": "naver.com",
    "rank": 483,
    "topic": "news",
    "country": "KR",
    "language": "en",
    "authors": "채상욱의 아파트 가치 가격 연구소,블로그성장멘토 그릿지선,그림으로 보는 눈에 띄는 경제와 세상,홍준일의 주간정세분석,Byte,네이버,최경애 Kyongae.Choi Yna.Co.Kr,연합뉴스,생애주기 맞춤 부동산전략,세특왕 김세특,최경애",
    "media": "https://ssl.pstatic.net/static.news/image/news/ogtag/navernews_800x420_20221201.jpg",
    "is_opinion": false,
    "twitter_account": "연합뉴스",
    "_score": 10.236951,
    "_id": "6e78c6491b47fead6fc3558afbf078fa"
  },
  {
    "title": "Tonight with Andrew Marr 13/01",
    "author": "Olly Roberts",
    "published_date": "2025-01-13 22:46:17",
    "published_date_precision": "full",
    "link": "https://www.lbc.co.uk/radio/presenters/andrew-marr/tonight-with-andrew-marr-13-01-25-watch-again",
    "clean_url": "lbc.co.uk",
    "excerpt": "You can watch Monday's Tonight With Andrew Marr in full here.",
    "summary": "Tonight with Andrew Marr 13/01 | Watch Again\nTonight with Andrew Marr 13/01 | Watch again\nBy Olly Roberts\nYou can watch Monday's Tonight With Andrew Marr in full here.\nListen to this article\nLoading audio...\nAndrew Marr was joined by:\nNatasha Clark : LBC Political Editor\n: LBC Political Editor Peter Kyle : Secretary of State for Science, Innovation and Technology\n: Secretary of State for Science, Innovation and Technology Baroness Brown (Julia King) : British engineer and Chair of the House of Lords Select Committee on Science and Technology\n: British engineer and Chair of the House of Lords Select Committee on Science and Technology Dr. Jeevun Sandher : Labour MP for Loughborough\n: Labour MP for Loughborough Dr. Adrian Boyle : President of the Royal College of Emergency Medicine\n: President of the Royal College of Emergency Medicine Aggie Chambre : LBC Political Correspondent\n: LBC Political Correspondent Adam McKay : Director of Don't Look Up, The Big Short, and the Anchorman series\n: Director of Don't Look Up, The Big Short, and the Anchorman series Gina Davidson : LBC Scotland Political Editor\n: LBC Scotland Political Editor Alan Zycinski : LBC Scotland Correspondent\n: LBC Scotland Correspondent Sir Craig Oliver: Former Downing Street Director of Communications and Partner at FGS Global\nWatch Tonight with Andrew Marr exclusively on Global Player every Monday to Thursday from 6pm to 7pm.",
    "rights": "lbc.co.uk",
    "rank": 7851,
    "topic": "news",
    "country": "GB",
    "language": "en",
    "authors": "Olly Roberts",
    "media": "https://images.lbc.co.uk/images/698808?width=1200&crop=16_9&signature=ozSzpbBlas2nbk9oMAqxbp4W9bM=",
    "is_opinion": false,
    "twitter_account": "@lbc",
    "_score": 10.098931,
    "_id": "cce4c94a41da5c6c3527cab5bd5fa2e3"
  },
  {
    "title": "At the Intersection of Code and Ideals: Reflections on Technology, Politics, and the Human Condition",
    "author": "Alex Matsuka",
    "published_date": "2025-01-29 00:43:52",
    "published_date_precision": "full",
    "link": "https://medium.com/@alex.mazuka/at-the-intersection-of-code-and-ideals-reflections-on-technology-politics-and-the-human-acc4f16b4ada",
    "clean_url": "medium.com",
    "excerpt": "(This article serves as an introduction and programmatic manifesto for a Medium channel dedicated to analyzing the impact of emerging…",
    "summary": "(This article serves as an introduction and programmatic manifesto for a Medium channel dedicated to analyzing the impact of emerging technologies on society through the lens of political science and philosophy.)\nWelcome to my channel, where we explore the tectonic shifts triggered by the digital revolution. As a seasoned political scientist, I have dedicated my career to studying the mechanisms of power, ideologies, and societal transformations. Today, on the threshold of a new era, I am convinced that emerging technologies—artificial intelligence (AI), blockchain, biotechnology, and others—are becoming the primary drivers of change, shaping the destiny of humanity in the 21st century.\nThis blog is not just another source of information about technological novelties. It is a space for in-depth analysis and reflection on how digital innovations intertwine with political systems, social structures, and, ultimately, with our very understanding of human nature.\nWhy political science and philosophy? These disciplines provide us with the tools for critical reflection on power, ethics, justice, and identity — concepts acquiring new meaning in the age of algorithms and virtual realities. We cannot afford to observe the unfolding technological revolution passively. We must ask difficult questions, analyze potential risks, and seek paths toward a harmonious coexistence with learning machines.\nOn this channel, we will explore, among other things, the following topics: Artificial Intelligence and Power: How is AI transforming the political landscape? Can algorithms replace politicians and bureaucrats? How will the automation of decision-making affect democratic institutions and civil liberties? Is there a threat of an 'algorithmic dictatorship'?\nHow is AI transforming the political landscape? Can algorithms replace politicians and bureaucrats? How will the automation of decision-making affect democratic institutions and civil liberties? Is there a threat of an 'algorithmic dictatorship'? Blockchain and Decentralization: Is blockchain capable of changing traditional hierarchies and creating a more transparent and just society? How do distributed ledgers affect financial systems, electoral processes, and the concept of national sovereignty?\nIs blockchain capable of changing traditional hierarchies and creating a more transparent and just society? How do distributed ledgers affect financial systems, electoral processes, and the concept of national sovereignty? Biotechnology and Ethics: What ethical dilemmas are posed by gene editing, biohacking, and other advancements in biotechnology? How do we regulate these areas without limiting scientific progress and jeopardizing human dignity?\nWhat ethical dilemmas are posed by gene editing, biohacking, and other advancements in biotechnology? How do we regulate these areas without limiting scientific progress and jeopardizing human dignity? Virtual Reality and Identity: How do virtual worlds influence our self-perception and social interactions? Will immersion in virtuality lead to a loss of connection with the real world and the degradation of social institutions?\nHow do virtual worlds influence our self-perception and social interactions? Will immersion in virtuality lead to a loss of connection with the real world and the degradation of social institutions? Digital Inequality and Social Justice: How can we ensure equal access to the benefits of the digital age and prevent the deepening of social inequality due to technological progress?\nMy goal is not simply to inform but to provoke thought, stimulate discussion, and inspire the search for solutions. I am convinced that the future is not predetermined. It is being created here and now through our collective efforts. Our ability to comprehend the challenges and opportunities of the digital age will determine the kind of world our descendants will inherit.\nI invite you to join me on this intellectual journey. Subscribe to the channel, read, comment, and debate. Only through open dialogue and a shared quest for truth can we build a future where technology serves the ideals of humanism, freedom, and justice.\nWelcome aboard!",
    "rights": "medium.com",
    "rank": 60,
    "topic": "entertainment",
    "country": "US",
    "language": "en",
    "authors": "Alex Matsuka",
    "media": "https://miro.medium.com/v2/resize:fit:1200/1*3KJYZhStUenJBt8PmMQhZQ.jpeg",
    "is_opinion": false,
    "twitter_account": "@Medium",
    "_score": 10.101421,
    "_id": "0840e5558eb876131e9f50dbbae5c777"
  },
  {
    "title": "Political Science Speaker Series",
    "author": "mandyc",
    "published_date": "2025-01-09 17:22:56",
    "published_date_precision": "full",
    "link": "https://gazette.mun.ca/events/political-science-speaker-series-3",
    "clean_url": "mun.ca",
    "excerpt": "Go to page content Friday, Jan. 17, 2:30-3:30 p.m. SN-2033 The Forgotten Frontline: Canada's Sub-National Governments and the Battle Against Foreign Election Interference Tamara A. Small University of…",
    "summary": "Friday, Jan. 17, 2:30-3:30 p.m.\nSN-2033\nThe Forgotten Frontline: Canada's Sub-National Governments and the Battle Against Foreign Election Interference\nTamara A. Small\nUniversity of Guelph\nAbstract:\nForeign interference is not a new phenomenon but an evolving one. Two interrelated phenomena, a new era of globalization and digital technologies, have coincided to create this challenge to democratic elections. The Public Inquiry into Foreign Interference in Federal Electoral Processes and Democratic Institutions is a federal body. The objective of the public inquiry is to examine and assess foreign interference in federal electoral processes and democratic institutions with respect to the 2019 and 2021 elections. However, as one media commentator opined 'does anyone seriously believe that hostile foreign states confine their efforts at foreign interference to the federal level of government and only during federal elections?' This analysis takes up the call to look beyond federal politics in understanding foreign interference by focusing on election law. While there has been extensive action on the part of the federal government, what of Canada's sub-national governments? To what extent have the provinces and territories addressed the threat of foreign interference in their respective election laws? Answering this question is the objective of this analysis. The comparative analysis finds that little is occurring legislatively at the sub-national level in Canada to combat foreign election interference. Canada's provinces and territories are a forgotten frontline.\nSpeaker Bio:\nTamara A. Small is a Professor in the Department of Political Science at the University of Guelph. She is a leading expert on the use of digital technologies by Canadian political actors. In addition to conducting research on digital campaigning in eight federal elections, she has published work on political memes and the regulatory framework for digital technologies in Canadian elections. She is the co-editor of Digital Politics in Canada: Promises and Realities (UTP).\nPresented by Dr. Sarah Martin Event Listing 2025-01-17 14:30:00 2025-01-17 15:30:00 America/St_Johns Political Science Speaker Series The Forgotten Frontline: Canada's Sub-National Governments and the Battle Against Foreign Election Interference Tamara A. Small University of Guelph Abstract: Foreign interference is not a new phenomenon but an evolving one. Two interrelated phenomena, a new era of globalization and digital technologies, have coincided to create this challenge to democratic elections. The Public Inquiry into Foreign Interference in Federal Electoral Processes and Democratic Institutions is a federal body. The objective of the public inquiry is to examine and assess foreign interference in federal electoral processes and democratic institutions with respect to the 2019 and 2021 elections. However, as one media commentator opined 'does anyone seriously believe that hostile foreign states confine their efforts at foreign interference to the federal level of government and only during federal elections?' This analysis takes up the call to look beyond federal politics in understanding foreign interference by focusing on election law. While there has been extensive action on the part of the federal government, what of Canada's sub-national governments? To what extent have the provinces and territories addressed the threat of foreign interference in their respective election laws? Answering this question is the objective of this analysis. The comparative analysis finds that little is occurring legislatively at the sub-national level in Canada to combat foreign election interference. Canada's provinces and territories are a forgotten frontline. Speaker Bio: Tamara A. Small is a Professor in the Department of Political Science at the University of Guelph. She is a leading expert on the use of digital technologies by Canadian political actors. In addition to conducting research on digital campaigning in eight federal elections, she has published work on political memes and the regulatory framework for digital technologies in Canadian elections. She is the co-editor of Digital Politics in Canada: Promises and Realities (UTP). SN-2033 Dr. Sarah Martin",
    "rights": "mun.ca",
    "rank": 5176,
    "topic": "politics",
    "country": "CA",
    "language": "en",
    "authors": "mandyc",
    "media": "https://i0.wp.com/gazette.mun.ca/wp-content/uploads/2020/05/favicon-32x32-1.png?fit=32%2C32&quality=100&ssl=1",
    "is_opinion": false,
    "twitter_account": "@MemorialU",
    "_score": 10.194761,
    "_id": "4d46e4ac10fb1884dfb8b24f47294a22"
  },
  {
    "title": "(EDITORIAL from Korea Times on Jan. 24)",
    "author": "최경애",
    "published_date": "2025-01-24 07:01:06",
    "published_date_precision": "timezone unknown",
    "link": "https://n.news.naver.com/mnews/article/001/0015178987",
    "clean_url": "naver.com",
    "excerpt": "dailies-editorials (2) Race for AI dominance Lesson in AI innovation vs. political turmoil In the ever-advancing field o",
    "summary": "dailies-editorials (2)\n(EDITORIAL from Korea Times on Jan. 24)\nRace for AI dominance\nLesson in AI innovation vs. political turmoil\nIn the ever-advancing field of artificial intelligence (AI), global powers are vying for dominance, with the United States under President Donald Trump leading the charge. The U.S. has unveiled a groundbreaking $500 billion investment plan to establish the infrastructure needed to propel AI to the forefront of the global economy.\nThe centerpiece of this initiative is the \"AI Manhattan Project,\" which includes a massive data center housing a supercomputer called \"Stargate.\" Set to be completed by 2028, this project is being driven by major tech players, including OpenAI, Oracle and SoftBank, with further contributions expected from Microsoft, Nvidia and Arm. Trump's administration has positioned this investment as the largest AI infrastructure program in history, promising to create over 100,000 jobs and secure the U.S.' leadership in next-generation technologies.\nThis ambitious plan represents more than just a technological leap — it is a strategic move to secure national competitiveness in the AI race. Trump's approach is grounded in deregulation and a focus on innovation.\nFrom Day 1 of his presidency, he has prioritized swift, decisive actions to secure energy supplies, recognizing the need for robust infrastructure to support technological growth. His administration's focus on energy security, combined with its push for AI innovation, exemplifies a model of governance that prioritizes long-term growth over regulatory obstacles.\nHowever, this aggressive stance stands in stark contrast to the situation in Korea. Last September, the Korean government outlined its own ambitious AI vision, seeking to become a global leader in AI. A national AI committee was formed under President Yoon Suk Yeol to spearhead this initiative.\nYet, despite these lofty goals, political instability has severely hindered progress. The committee has been largely inactive since Yoon became embroiled in controversy and taken into temporary custody, following his failed martial law declaration and subsequent impeachment proceedings. These political challenges have resulted in a major slowdown of the country's AI ambitions.\nKorea's vision for AI includes a joint public-private investment of 2 trillion won ($1.4 billion) to build an AI computing center, which is expected to facilitate AI research and development across universities, research institutes and startups.\nHowever, there are growing concerns about the feasibility of this plan, especially when compared to the U.S. initiative. South Korea's efforts are now at risk of falling short of expectations, particularly given the political instability and logistical challenges such as delays in energy infrastructure projects. Political squabbles over nuclear power plant construction and electricity distribution issues exacerbate the problem further.\nThe Korean situation illustrates the dangers of excessive political gridlock and the failure to act decisively in a rapidly evolving technological landscape. While the U.S. embraces innovation and aims to build an AI ecosystem without being hampered by overregulation, Korea's progress is stymied by infighting and delays in critical infrastructure development. The key takeaway is clear: to compete in the AI race, nations must set aside political differences and act swiftly to implement their technological visions.\nKorea is not alone in facing this dilemma. China has been taking a contrasting approach, expanding its AI capabilities aggressively. In both China and the U.S., government action is seen as central to fostering innovation, with significant investments and clear policies that facilitate rapid technological advancement. In contrast, countries like Korea, bogged down by internal political struggles, risk falling behind in the race for AI supremacy.\nTo avoid such a fate, Korea — and other countries facing similar challenges — must refocus on what matters: advancing AI development and fostering a competitive, innovative environment. This means minimizing political interference, ensuring the stability of the regulatory environment and prioritizing infrastructure development. Political leaders must be willing to make bold decisions for the long-term benefit of the nation, rather than succumbing to short-term political pressures.\nThe AI revolution is not just about technology; it's about economic security and global leadership. The U.S. is taking decisive steps toward securing its future in this rapidly evolving field, while Korea risks being left behind due to its political deadlock. The lesson is clear: to stay competitive, nations must put innovation first, leaving political squabbles in the past. Only then can they hope to harness the full potential of AI to secure their place in the global economy.",
    "rights": "naver.com",
    "rank": 483,
    "topic": "news",
    "country": "KR",
    "language": "en",
    "authors": "채상욱의 아파트 가치 가격 연구소,블로그성장멘토 그릿지선,그림으로 보는 눈에 띄는 경제와 세상,홍준일의 주간정세분석,Byte,네이버,최경애 Kyongae.Choi Yna.Co.Kr,연합뉴스,생애주기 맞춤 부동산전략,세특왕 김세특,최경애",
    "media": "https://ssl.pstatic.net/static.news/image/news/ogtag/navernews_800x420_20221201.jpg",
    "is_opinion": false,
    "twitter_account": "연합뉴스",
    "_score": 10.113597,
    "_id": "6e78c6491b47fead6fc3558afbf078fa"
  },
  {
    "title": "2025–2045: my predictions",
    "author": "Anarchistnoa",
    "published_date": "2025-01-04 00:15:03",
    "published_date_precision": "full",
    "link": "https://medium.com/@Anarchistnoa/2025-2045-my-predictions-for-the-next-20-years-3c98d57193e0",
    "clean_url": "medium.com",
    "excerpt": "Predictions",
    "summary": "So starting with the short term, (2025–2030) the short term is the trickiest part of this prediction, If Trump has a good term, it is likely a Republican will win the 2028 election & the Republican coalition will remain intact throughout the 30s, but in 2032 a Democrat will win the office and likely win reelection in 2036, if this happens 2040 would likely be a close election.\nAnother scenario is a bad Trump term, which I believe is more likely than a good one, if this happens the democrats will win big in 2028, and the Republican coalition will collapse meaning they win in 2032 even if things are still somewhat bad.\nI find it likely the tech bro right & the conspiratorial people will come into conflict sometime during this decade or the next, I believe the democrats may absorb the tech bro right, the conspiratorial MAHA people are very skeptical of technology & as technology advances they won't go away, they will get caught up in moral panic about AI, womb technologies, smart home technologies, medical technologies etc, and this will off-put the tech bro right, as this will happen in the 30s, and the 30s will no doubt be democrat dominated, I believe they will go hard against the democrats and their 'agenda' and continue to embrace reactionary politics, tech bro circles will shift left in reaction to the ever-present rise of technophobic reactionary politics in the Republican party, becoming an important part of the Democratic coalition, the democrats will become more Libertarian, while the Republicans more authoritarian, as has happened over the last 10 years, and the young dudebro tech Trump sphere will transform into more of a Democrat supporting space, this will happen regardless of whether Trump has a good term or not.\nThe potential for a Trump health crisis is also something worth noting, as RFK has shown skepticism towards modern medicine and has embraced theories about raw milk being healthy and whatnot, so I would not be surprised if something like that happen, maybe not like covid, although that is possible.\nDue to political developments in the 30s, the Republicans will become the populist party, technophobia, contrarian nonsense & nature worship will be in fashion in GOP spaces, and the potential for one of these weird populists to win is something to consider, maybe we have a weird populist president serve from 2041–2045 (or earlier) or even 2041-2049 if he/she plays his cards right, although given the flawed nature of governance based solely on populism, an appeal to nature fallacy, and contrarianism, I highly doubt that. The Republican party is likely to become an weird open thing for Populists and grifters if Trump has a bad term, and will stabilize after or around the 2036 election and before the 2044 one, I can't say much about 2030s culture, it'll probably be brighter and less minimalistic than now, 2000s nostalgia will peak and 2010s nostalgia will start entering the mainstream so that will lead to some interesting developments, the popularity of populism will remain due to long term economic trends continuing, I expect it to be popular into the 30s, 40s, 50s, 60s and beyond, I believe it's here to stay.\n20s nostalgia will also enter the mainstream in the mid 40s (2044–2046) which is interesting.\nTechnologies such as Automation, smart homes/alexa style things, augmentation, VR, AI will continue to develop and may even cause a technological boom similar to that of the middle 20th and 19th centuries, due to economic reasons, single family homes will be more of a thing for older people rather than younger people, people will live in apartments more and as a response to the current loneliness epidemic, these apartments will have spaces for play and hangout which may be cultural hubs, the automation of several jobs, death of the 'old American way' (white picket fences, suburbs, the older economy, new technologies) will lead to a lot of reactionary populism.\nThese technologies will reshape our infrastructure, so we will have to tear down a lot of older buildings to make way as this technology becomes more mainstream, which may lead to a nimby 'preserve our buildings!' movement in the 30s/40s, between now and 2045 which will make local politics a divide between more nimby/yimby people, in fact politics in general may just become rather Progressive tech bro/Reactionary technoskeptic divided.\nOverall these are my predictions for the next 20 years, but I though Harris would win in 2024 so what do I know.",
    "rights": "medium.com",
    "rank": 60,
    "topic": "entertainment",
    "country": "US",
    "language": "en",
    "authors": "Anarchistnoa",
    "media": "https://miro.medium.com/v2/5d8de952517e8160e40ef9841c781cdc14a5db313057fa3c3de41c6f5b494b19",
    "is_opinion": false,
    "twitter_account": "@Medium",
    "_score": 10.064702,
    "_id": "c11718bf71649a6609a17a66fd1cfc3a"
  },
  {
    "title": "With Trump, Tech Leaders Are In a Better Place to Shape US Policy",
    "author": "Edwin Liava'a",
    "published_date": "2025-01-22 14:37:28",
    "published_date_precision": "full",
    "link": "https://hackernoon.com/with-trump-tech-leaders-are-in-a-better-place-to-shape-us-policy",
    "clean_url": "hackernoon.com",
    "excerpt": "Elon Musk, Jeff Bezos, Mark Zuckerberg, Sundar Pichai, and Tim Cook find themselves increasingly drawn into the political arena.",
    "summary": "As I announce my candidacy for the Tongan Parliament in the upcoming November elections, I am reminded of a profound shift we witnessed during the Trump Administration when tech titans like Elon Musk, Jeff Bezos, Mark Zuckerberg, Sundar Pichai, and Tim Cook found themselves increasingly drawn into the political arena. Their journey mirrors the realization I've come to: \"I am all in on building a better world powered by cryptography. My biggest challenge is resistance to change, and that's what drives my creative journey.\"\nLet me be clear about my commitment: \"I am dedicated to making Tonga the Web3 Tech Hub of the Pacific whereby, when I am not proposing and voting for Legislation in Parliament; I will be offering my 30+ years of experience \"Free of Charge\" as a personal Mentor, Teacher and Trainer to all citizens with or without any formal education qualifications to make something of themselves within the domains of Web3, Software Engineering, Prompt Engineering, Geomatics, Geospatial, GIS, Internet and Telecommunications.\nThe intersection of technology and politics is no longer optional, it's imperative. During the Trump years, we saw tech leaders step beyond their corporate roles not by choice, but by necessity. They recognized what I now see clearly: the decisions that shape our digital future are not made in development labs or startup incubators, but in legislative chambers and policy meetings.\nThese tech visionaries didn't enter politics for power or prestige. They engaged because they understood that remaining on the sidelines meant watching crucial decisions about technology, innovation, and our digital future being made by those who might not fully grasp their implications. When discussions about data privacy, AI regulation, cryptocurrency, and digital infrastructure came to the forefront, their expertise wasn't just valuable, it was/is essential.\nTheir experience teaches us a crucial lesson: we cannot separate technological innovation from political reality. When Mark Zuckerberg testified before Congress about social media's impact on society, or when Elon Musk engaged with governments about space exploration and electric vehicle policies, they weren't just defending their companies, they were advocating for informed, forward-thinking approaches to technological advancement.\nThis realization has profound implications for Tonga's future. As I prepare to run for Parliament, I'm not stepping away from my role as a tech advocate, I'm expanding it. My vision of making Tonga the Web3 Tech Hub of the Pacific isn't just a technological aspiration; it's a political imperative that requires legislative support and governmental understanding.\nThe role I envision goes beyond traditional political boundaries. When not in Parliament proposing and voting on legislation, I commit to serving as a mentor, teacher, and trainer to all Tongans, regardless of their formal education. Web3 technology offers unprecedented opportunities for economic empowerment and innovation, but only if we create the right regulatory framework and educational infrastructure to support it.\nConsider the transformation we've already begun. Our work with decentralized governance models, the integration of blockchain technology, and the development of digital infrastructure has laid the groundwork. But to fully realize this potential, we need voices in Parliament who understand both the technological possibilities and the regulatory challenges.\nThe resistance to change I've encountered in promoting Web3 and blockchain solutions isn't just about technological skepticism, it's about institutional inertia. By taking a seat at the legislative table, we can address these challenges head-on, crafting policies that protect our citizens while fostering innovation.\nThis is why I'm committing to this new chapter in my journey. The time for tech advocates to merely advise from the sidelines has passed. Like those tech leaders who engaged with Washington during the Trump era, we must step into the arena where decisions are made. My campaign for Parliament isn't just about winning a seat, it's about ensuring that Tonga's future is shaped by those who understand the transformative power of technology.\nThe path forward requires us to bridge the gap between technological innovation and political reality. As I prepare to share my detailed campaign roadmap in the coming weeks, I'm reminded that this journey isn't just about personal ambition, it's about creating a future where technology serves all Tongans, where innovation is encouraged, and where our nation leads the Pacific in embracing the digital transformation.\nTo my fellow tech advocates and to all Tongans: the time for action is now. We can no longer afford to let critical decisions about our digital future be made without our direct involvement. Join me in this mission to transform Tonga into a beacon of technological innovation, where Web3 technology isn't just a buzzword, but a pathway to prosperity for all our citizens.\nThe future is not something that happens to us, it's something we create. Let's create it together, in the halls of Parliament and in the digital spaces where innovation thrives.",
    "rights": "hackernoon.com",
    "rank": 1853,
    "topic": "tech",
    "country": "US",
    "language": "en",
    "authors": "Edwin Liava'a",
    "media": "https://hackernoon.imgix.net/images/2jqChkrv03exBUgkLrDzIbfM99q2-oi02tnq.jpeg",
    "is_opinion": false,
    "twitter_account": "@hackernoon",
    "_score": 10.022516,
    "_id": "bc59431f6786074db43cf66ae4f6ae61"
  },
  {
    "title": "Race for AI dominance",
    "author": "",
    "published_date": "2025-01-23 06:09:00",
    "published_date_precision": "full",
    "link": "https://www.koreatimes.co.kr/www/opinion/2025/01/202_390997.html",
    "clean_url": "koreatimes.co.kr",
    "excerpt": "In the ever-advancing field of artificial intelligence (AI), global powers are vying for dominance, with the United States under President Donald Trump leading the charge. The U.S. has unveiled a groundbreaking $500 billion investment plan to establish the infrastructure needed to propel AI to the forefront of the global economy. The centerpiece of this initiative is the 'AI Manhattan Project,' which includes a massive data center housing a supercomputer called 'Stargate.' Set to be completed by 2028, this project is being driven by major tech players, including OpenAI, Oracle and SoftBank, with further contributions expected from Microsoft, Nvidia and Arm. Trump's administration has positioned this investment as the largest AI infrastructure program in history, promising to create over 100,000 jobs and secure the U.S.' leadership in next-generation technologies.",
    "summary": "Lesson in AI innovation vs. political turmoil\nIn the ever-advancing field of artificial intelligence (AI), global powers are vying for dominance, with the United States under President Donald Trump leading the charge. The U.S. has unveiled a groundbreaking $500 billion investment plan to establish the infrastructure needed to propel AI to the forefront of the global economy. The centerpiece of this initiative is the 'AI Manhattan Project,' which includes a massive data center housing a supercomputer called 'Stargate.' Set to be completed by 2028, this project is being driven by major tech players, including OpenAI, Oracle and SoftBank, with further contributions expected from Microsoft, Nvidia and Arm. Trump's administration has positioned this investment as the largest AI infrastructure program in history, promising to create over 100,000 jobs and secure the U.S.' leadership in next-generation technologies.\nThis ambitious plan represents more than just a technological leap — it is a strategic move to secure national competitiveness in the AI race. Trump's approach is grounded in deregulation and a focus on innovation. From Day 1 of his presidency, he has prioritized swift, decisive actions to secure energy supplies, recognizing the need for robust infrastructure to support technological growth. His administration's focus on energy security, combined with its push for AI innovation, exemplifies a model of governance that prioritizes long-term growth over regulatory obstacles.\nHowever, this aggressive stance stands in stark contrast to the situation in Korea. Last September, the Korean government outlined its own ambitious AI vision, seeking to become a global leader in AI. A national AI committee was formed under President Yoon Suk Yeol to spearhead this initiative. Yet, despite these lofty goals, political instability has severely hindered progress. The committee has been largely inactive since Yoon became embroiled in controversy and taken into temporary custody, following his failed martial law declaration and subsequent impeachment proceedings. These political challenges have resulted in a major slowdown of the country's AI ambitions.\nKorea's vision for AI includes a joint public-private investment of 2 trillion won ($1.4 billion) to build an AI computing center, which is expected to facilitate AI research and development across universities, research institutes and startups. However, there are growing concerns about the feasibility of this plan, especially when compared to the U.S. initiative. South Korea's efforts are now at risk of falling short of expectations, particularly given the political instability and logistical challenges such as delays in energy infrastructure projects. Political squabbles over nuclear power plant construction and electricity distribution issues exacerbate the problem further.\nThe Korean situation illustrates the dangers of excessive political gridlock and the failure to act decisively in a rapidly evolving technological landscape. While the U.S. embraces innovation and aims to build an AI ecosystem without being hampered by overregulation, Korea's progress is stymied by infighting and delays in critical infrastructure development. The key takeaway is clear: to compete in the AI race, nations must set aside political differences and act swiftly to implement their technological visions.\nKorea is not alone in facing this dilemma. China has been taking a contrasting approach, expanding its AI capabilities aggressively. In both China and the U.S., government action is seen as central to fostering innovation, with significant investments and clear policies that facilitate rapid technological advancement. In contrast, countries like Korea, bogged down by internal political struggles, risk falling behind in the race for AI supremacy.\nTo avoid such a fate, Korea — and other countries facing similar challenges — must refocus on what matters: advancing AI development and fostering a competitive, innovative environment. This means minimizing political interference, ensuring the stability of the regulatory environment and prioritizing infrastructure development. Political leaders must be willing to make bold decisions for the long-term benefit of the nation, rather than succumbing to short-term political pressures.\nThe AI revolution is not just about technology; it's about economic security and global leadership. The U.S. is taking decisive steps toward securing its future in this rapidly evolving field, while Korea risks being left behind due to its political deadlock. The lesson is clear: to stay competitive, nations must put innovation first, leaving political squabbles in the past. Only then can they hope to harness the full potential of AI to secure their place in the global economy.",
    "rights": "koreatimes.co.kr",
    "rank": 2814,
    "topic": "news",
    "country": "KR",
    "language": "en",
    "authors": "",
    "media": "https://www.koreatimes.co.kr/www/images/KT_news_20221025.jpg",
    "is_opinion": true,
    "twitter_account": "@koreatimes",
    "_score": 10.068002,
    "_id": "135c21a30bde6209ea458945a81e30ba"
  },
  {
    "title": "The problem is in the political elite, not in the technology of reporting election results",
    "author": "FAKTI.BG",
    "published_date": "2025-01-08 12:17:56",
    "published_date_precision": "full",
    "link": "https://fakti.bg/en/mnenia/940105-problemat-e-v-politicheskia-elit-a-ne-v-tehnologiata-na-otchitane-na-izbornite-rezultati",
    "clean_url": "fakti.bg",
    "excerpt": "Comment by Stanislav Todorov The obsession with the technology of reporting election results (by the PP-DB) shows the exhausted ideological basis of political parties. Te",
    "summary": "publishes opinions with a wide range of perspectives to encourage constructive debates.\nThe obsession with the technology of reporting election results (by the PP-DB) shows the exhausted ideological basis of political parties. Technological changes will not increase trust in the political system and election procedures, respectively, nor trust in political parties. If election technology works for the opposing camp (for GERB and company), this is also a symptom of the ideological impotence of political subjects - the democratic race is won through election technology, not through an ideological clash. In other words, our democracy is simply a technology for reporting election results, some master the technological process, while others do not, which is why the disputes are in this field.\nIf our political elite understands democracy in this way, as a struggle for the method of technological reporting of election results, then the problem is not in the election technology, but in the political elite.\nElections should perform a selective function - to provide the opportunity for people to select significant political proposals and representatives who are capable of defending them.\nIf elections do not perform a selective function, because there are no significant political proposals, and one of the reasons for the election results is purely technological, then the problem is not in the technology. We have a political elite that does not produce significant competing ideas, but competes in the field of pure procedure (how the technology for reporting election results should work).\nThe problem is in the political elite, not in the technology. We need to change the political elite, not the technology of broadcasting it.",
    "rights": "fakti.bg",
    "rank": 109559,
    "topic": "news",
    "country": "BG",
    "language": "en",
    "authors": "FAKTI.BG,Fakti",
    "media": "https://cdn4.focus.bg/fakti/photos/fb/2b2/problemat-e-v-politicheskia-elit-a-ne-v-tehnologiata-na-otchitane-na-izbornite-rezultati-1.webp",
    "is_opinion": false,
    "twitter_account": null,
    "_score": 10.544043,
    "_id": "b545787781cd68f5713a607c2bda0d6d"
  },
  {
    "title": "Who will serve the unmet political needs created by the AI revolution?",
    "author": "David Coletto",
    "published_date": "2025-01-26 13:13:56",
    "published_date_precision": "full",
    "link": "https://davidcoletto.substack.com/p/who-will-serve-the-unmet-needs-created",
    "clean_url": "substack.com",
    "excerpt": "The \"Tech Right\" and the emerging need for political and policy solutions",
    "summary": "I'm been thinking a lot lately about what AI and automation is going to mean for politics.\nRecent surveys I've done suggest that Canadians are increasingly torn between the promise of technological innovation and the potential disruption it poses for traditional industries and jobs. For example, only 39% think making Canada an AI superpower would make them better off.\nManufacturing, natural resource, retail, public services, and other similar (legacy) sectors have long been the backbone of Canada's workforce, providing stable employment and a sense of economic security. Yet, the rapid emergence of the 'Tech Right'—entrepreneurs and innovators who advocate for freer markets, minimal regulation, and a government that is agile and tech-savvy—is shifting our political conversation. They clearly have influence within Pierre Poilievre's sphere and he likely shares many of their views. This new faction's influence raises pressing questions about the future of work, consumer benefits, and the balance between progress and stability.\nHistorically, Canada's labour movements and parties, such as the CCF and later the NDP, emerged to protect workers from the upheavals of industrialization. Widespread access to the franchise and the resulting political empowerment helped shape policies around labour rights, social welfare, and equitable growth. Now, rapid advancements in automation and artificial intelligence threaten similar upheavals in a post-industrial economy. Workers in manufacturing and retail may be displaced by technological solutions that promise efficiency and lower costs for consumers. At the same time, these technologies can drive down prices, speed up service delivery, and expand consumer choice.\nThis paradox—where some benefit from cheaper goods and services while others see their jobs replaced or transformed— creates a new set of political demands.\nThese include calls for modernized social safety nets, faster reskilling programs, and strategic partnerships between government, industry, and educational institutions. Voters are looking for leadership that can balance the benefits of innovation with the need for job security and social stability. For many, the old 'labour vs. business' political framework seems mismatched to the complexities of a tech-driven landscape.\nThat is where the 'Tech Right' offers both potential and peril. On one hand, it brings fresh thinking about how to streamline government services, improve state capacity, and leverage technology to address policy bottlenecks (such as interprovincial trade barriers or immigration backlogs). If done well, consumers and workers could see tangible benefits in the form of more efficient public programs, faster approvals, and new channels for economic growth. On the other hand, these innovators may downplay the disruption their technologies cause in traditional sectors, leaving many workers anxious and unprepared for a shifting economy.\nThe question facing Canadian politics is whether any existing party or coalition can champion this new social contract: one that embraces tech-driven growth while ensuring that workers and communities are not left behind.\nSome Conservatives see an opening to unite pro-market technology enthusiasts with working-class voters by promising job creation in emerging industries. Liberals and New Democrats may attempt to integrate these tech-friendly policies within a broader agenda of equity, environmental sustainability, and worker protections.\nWhat is clear is that a new generation of voters—raised on smartphones and increasingly skeptical of outdated economic models—expects pragmatic solutions that harness technology without sacrificing fairness. Parties that can articulate this balanced vision will have an edge. Whether it emerges from within an existing political movement or spurs the creation of a new one, this alignment of tech-driven optimism with worker-focused policy could reshape Canada's political landscape in the coming decade.",
    "rights": "substack.com",
    "rank": 278,
    "topic": "news",
    "country": "US",
    "language": "en",
    "authors": "David Coletto",
    "media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fde309118-08b7-41da-b35b-20dacb44fe15_584x579.png",
    "is_opinion": false,
    "twitter_account": null,
    "_score": 10.11646,
    "_id": "f3011c2f20eb757f72ef5e1e56d2593d"
  },
  {
    "title": "Trending News Today Live Updates on January 4, 2025 : Sonic the Hedgehog 3 review: Action, emotion, and nostalgia – Fans are loving every moment",
    "author": "Livemint",
    "published_date": "2025-01-03 19:05:25",
    "published_date_precision": "full",
    "link": "https://www.livemint.com/news/trends/latest-trending-news-today-on-january-4-2025-live-updates-11735931126181.html",
    "clean_url": "livemint.com",
    "excerpt": "Trending News Today Live Updates on January 4, 2025: Stay updated with the most talked-about topics and breaking stories from around the world. Get live updates on trending events across various domains, including politics, technology, entertainment, sports, and global affairs, all in one place. Don't miss out on what's making headlines right now.",
    "summary": "Back\nTrending News Today Live Updates on January 4, 2025: Stay updated with the most talked-about topics and breaking stories from around the world. Get live updates on trending events across various domains, including politics, technology, entertainment, sports, and global affairs, all in one place. Don't miss out on what's making headlines right now.\nTrending News Today Live Updates: In today's fast-paced world, staying informed about the latest developments is more important than ever. Trending News Today brings you the most current and impactful stories from across the globe, covering a wide range of topics including politics, technology, entertainment, sports, and social issues. Whether it's a significant political event, a groundbreaking technological innovation, or the latest in pop culture, we provide you with up-to-the-minute updates and in-depth analysis. Our goal is to ensure that you're always in the loop, aware of the trends that are shaping the world around us. Stay tuned for the latest news that matters.",
    "rights": "livemint.com",
    "rank": 1291,
    "topic": "news",
    "country": "IN",
    "language": "en",
    "authors": "Livemint",
    "media": "https://www.livemint.com/lm-img/img/2025/01/03/1600x900/sonic_1735930791150_1735930799853.jpg",
    "is_opinion": false,
    "twitter_account": "@mint",
    "_score": 10.282307,
    "_id": "ee77343fe37bc31b484d39f31e746fe3"
  }
]