[
  {
    "title": "Ministers ontmoetten elkaar op veiligheidstop in München. Dit zijn de belangrijkste conclusies",
    "author": "De Morgen",
    "published_date": "Gisteren, 14:26",
    "link": "https://scienceupdates.org/20250122-renewable-energy-advancements",
    "clean_url": "scienceupdates.org",
    "excerpt": "De nouvelles innovations améliorent l'efficacité des sources d'énergie renouvelables.",
    "summary": "Des chercheurs développent des technologies pour améliorer le rendement des panneaux solaires et des éoliennes, réduisant ainsi la dépendance aux énergies fossiles.",
    "topic": "énergie et innovation",
    "media": "https://i.ibb.co/ycTZXmBk/nl-1.jpg",
    "explanation": "Les ministres de l'Intérieur se sont réunis pour disc"
  },
  {
    "title": "Nieuwe binnenlandminister stelt plan voor om Brusselse maffia hard aan te pakken",
    "author": "VRT NWS",
    "published_date": "Vandaag, 08:45",
    "link": "https://financeworld.com/news/global-economic-trends-2025",
    "clean_url": "financeworld.com",
    "excerpt": "Une analyse des dynamiques économiques affectant les marchés internationaux.",
    "summary": "L'économie mondiale évolue avec des transformations dans les chaînes d'approvisionnement et les investissements technologiques. Les experts évaluent les impacts sur la croissance et l'emploi.",
    "topic": "économie et société",
    "media": "https://i.ibb.co/VWkWVK6T/nl-2.jpg"

  },
  {
    "title": "Smartphoneverbod op school in Sint-Genesius-Rode is groot succes: “Leerlingen hebben weer oog voor elkaar”",
    "author": "HLN",
    "published_date": "Vandaag, 07:36",
    "link": "https://edtechnews.com/ai-in-education",
    "clean_url": "edtechnews.com",
    "excerpt": "L'IA transforme les méthodes d'apprentissage et d'enseignement dans les écoles et universités.",
    "summary": "L'intégration de l'intelligence artificielle dans l'éducation permet un apprentissage personnalisé et améliore l'engagement des étudiants. Des outils numériques adaptatifs gagnent en popularité.",
    "topic": "éducation et technologie",
    "media": "https://i.ibb.co/TD9P66sb/nl-3.jpg"
  },
  {
    "title": "Nationale voetbalvrouwen stellen nieuwe outfit voor",
    "author": "Sporza",
    "published_date": "Gisteren, 19:56",
    "link": "https://urbannews.com/sustainable-transport-infrastructure",
    "clean_url": "urbannews.com",
    "excerpt": "Des initiatives pour moderniser les transports urbains tout en réduisant l’empreinte carbone.",
    "summary": "Les gouvernements investissent dans des infrastructures de transport durable, incluant les tramways électriques et les voies cyclables, pour améliorer la mobilité urbaine.",
    "topic": "environnement et urbanisme",
    "media": "https://i.ibb.co/bgCr4K5z/nl-4.jpg"

  },
  {
    "title": "Deze films gaan dit jaar met de meeste prijzen lopen ",
    "author": "De Standaard",
    "published_date": "Vandaag 09:32",
    "link": "https://spaceexplorers.com/astronomy-new-discoveries",
    "clean_url": "spaceexplorers.com",
    "excerpt": "Les observations récentes révèlent de nouvelles perspectives sur l'univers.",
    "summary": "Des astronomes découvrent des exoplanètes et étudient de nouvelles théories sur la formation des galaxies, ouvrant la voie à des avancées en astrophysique.",
    "topic": "science et exploration spatiale",
    "media": "https://i.ibb.co/DDn5K0xJ/nl-5.png"

  }
]